tests/load-test.yml
config:
  target: "https://api.muslimcompass.io"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Ramp up"
    - duration: 180
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: "Restaurant API Test"
    weight: 40
    flow:
      - post:
          url: "/api/v1/nearest-restaurants"
          json:
            lat: 43.6532
            lng: -79.3832
          expect:
            - statusCode: [200, 401] # Accept both success and auth failure
            - hasHeader: "content-type"
      - think: 2
  - name: "User Registration Test"
    weight: 20
    flow:
      - post:
          url: "/api/v1/register"
          json:
            name: "Test User {{ $randomString() }}"
            email: "test{{ $randomString() }}@example.com"
            password: "testpassword123"
            role: "user"
          expect:
            - statusCode: [200, 400] # Accept both success and validation errors
      - think: 3
  - name: "User Login Test"
    weight: 20
    flow:
      - post:
          url: "/api/v1/login"
          json:
            email: "test@example.com"
            password: "testpassword"
          expect:
            - statusCode: [200, 401] # Accept both success and auth failure
      - think: 2
  - name: "Wishlist Test"
    weight: 10
    flow:
      - post:
          url: "/api/v1/get-wishlist"
          json: {}
          headers:
            Authorization: "Bearer test-token"
          expect:
            - statusCode: [200, 401] # Accept both success and auth failure
      - think: 2
  - name: "Support Test"
    weight: 10
    flow:
      - get:
          url: "/api/v1/all-support-ticket"
          expect:
            - statusCode: [200, 401]
      - think: 2